#### در صورت امکان، برنامه ها باید از ترکیب داده‌های قابل کنترل توسط کاربر در صفحاتی که برای دستورالعمل‌های SSI پردازش می‌شوند، اجتناب کنند. تقریباً در هر شرایطی، روش‌های جایگزین امن‌تری برای اجرای عملکرد مورد نیاز وجود دارد. اگر این امر امکان‌پذیر تلقی نمی‌شود، داده‌ها باید به شدت تایید شوند. در حالت ایده‌آل، یک لیست سفید از مقادیر خاص پذیرفته شده باید استفاده شود. در غیر این صورت، فقط رشته‌های الفبایی عددی کوتاه باید پذیرفته شوند. ورودی حاوی هر داده دیگری، از جمله هر متاکاراکتر SSI قابل تصور، باید رد شود.
* غیرفعال کردن اجرای SSI در صفحاتی که به آن نیاز ندارند.
* برای صفحاتی که به SSI نیاز دارند، فقط دستورات SSI را که برای این صفحه مورد نیاز است فعال کنید و بقیه را غیرفعال کنید.
* داده‌های ارائه شده توسط کاربر را قبل از ارسال به صفحه‌ای با مجوزهای اجرای SSI رمزگذاری کنید.
* از SUExec استفاده کنید تا صفحه به عنوان مالک فایل به جای کاربر وب‌سرور اجرا شود.
